// coverage:ignore-file
// ignore_for_file: unused_import, duplicate_ignore
/// ********************************************************************************************************
/// ▄▄▄▄▄ ▄▄    ▄▄ ▄▄ ▄▄▄▄▄▄ ▄▄▄▄▄▄ ▄▄▄▄▄ ▄▄▄▄     ▄▄▄▄  ▄▄▄  ▄▄     ▄▄▄▄ ▄▄ ▄▄ ▄▄     ▄▄▄ ▄▄▄▄▄▄ ▄▄▄  ▄▄▄▄
/// ██▄▄  ██    ██ ██   ██     ██   ██▄▄  ██▄█▄   ██▀▀▀ ██▀██ ██    ██▀▀▀ ██ ██ ██    ██▀██  ██  ██▀██ ██▄█▄
/// ██    ██▄▄▄ ▀███▀   ██     ██   ██▄▄▄ ██ ██   ▀████ ██▀██ ██▄▄▄ ▀████ ▀███▀ ██▄▄▄ ██▀██  ██  ▀███▀ ██ ██
/// ********************************************************************************************************

// ignore: unused_import

// 📦 Package imports:
import 'package:intl/intl.dart' as intl;

// 🌎 Project imports:
import 'package:calculator/l10n/gen/app_localizations.dart';

/// The translations for Korean (`ko`).
class AppLocalizationsKo extends AppLocalizations {
  AppLocalizationsKo([super.locale = 'ko']);

  @override
  String get calculatorAppBarTitle => '계산기';
}
